[
  {
    "id": "funcional",
    "title": "Teste Funcional",
    "description": "Valida se o sistema faz o que deveria fazer com base nos requisitos.",
    "full_text": "O Teste Funcional verifica se cada função do software opera de acordo com as especificações. Ele se concentra nas ações do usuário e nos resultados esperados, sem se preocupar com a estrutura interna do código. É crucial para garantir que o software atenda às necessidades do negócio e do usuário final.",
    "example": "Exemplo: Em um sistema de e-commerce, verificar se o botão 'Adicionar ao Carrinho' realmente adiciona o item selecionado ao carrinho de compras e atualiza o total corretamente.",
    "video_link": ""
  },
  {
    "id": "nao_funcional",
    "title": "Teste Não Funcional",
    "description": "Avalia atributos como desempenho, usabilidade e segurança.",
    "full_text": "O Teste Não Funcional avalia características do software que não estão diretamente relacionadas à sua funcionalidade, mas sim à sua qualidade e experiência de uso. Isso inclui testes de performance (velocidade, escalabilidade), usabilidade (facilidade de uso), segurança (proteção contra acessos não autorizados) e confiabilidade (capacidade de operar sem falhas por um período).",
    "example": "Exemplo: Testar o tempo de carregamento de uma página web sob diferentes condições de rede para garantir que ela carregue em menos de 3 segundos, conforme o requisito de desempenho.",
    "video_link": ""
  },
  {
    "id": "regressao",
    "title": "Teste de Regressão",
    "description": "Garante que novas funcionalidades ou correções não quebrem o que já funcionava.",
    "full_text": "O Teste de Regressão é executado para garantir que as alterações no código (sejam novas funcionalidades, correções de bugs ou refatorações) não introduzam novos defeitos ou causem a regressão de funcionalidades existentes que antes funcionavam corretamente. É uma prática essencial em ciclos de desenvolvimento ágeis, onde o código é frequentemente modificado.",
    "example": "Exemplo: Após a implementação de um novo recurso de pagamento, reexecutar todos os testes de login, cadastro de usuário e navegação de produtos para garantir que essas funcionalidades básicas ainda operam como esperado.",
    "video_link": ""
  },
  {
    "id": "integracao",
    "title": "Teste de Integração",
    "description": "Verifica se módulos/sistemas funcionam corretamente em conjunto.",
    "full_text": "O Teste de Integração foca na verificação das interfaces e interações entre diferentes módulos ou componentes de um sistema. O objetivo é identificar defeitos que surgem quando os componentes são combinados, garantindo que eles trabalhem juntos de forma coesa para atingir os objetivos do sistema.",
    "example": "Exemplo: Testar a integração entre o módulo de cadastro de clientes e o módulo de processamento de pedidos para garantir que as informações do cliente sejam corretamente transferidas e utilizadas ao finalizar uma compra.",
    "video_link": ""
  },
  {
    "id": "unidade",
    "title": "Teste de Unidade",
    "description": "Foca em testar pequenas partes do código, como funções e métodos.",
    "full_text": "O Teste de Unidade é o nível mais baixo de teste, focado em verificar a menor parte testável de uma aplicação, geralmente uma função ou método. É realizado pelos desenvolvedores durante a fase de codificação para garantir que cada unidade de código funcione conforme o esperado de forma isolada. Isso ajuda a identificar bugs precocemente e facilita a depuração.",
    "example": "Exemplo: Escrever um teste para uma função que calcula o imposto de um produto, verificando se ela retorna o valor correto para diferentes entradas (preço do produto, alíquota de imposto).",
    "video_link": ""
  },
  {
    "id": "aceitacao",
    "title": "Teste de Aceitação",
    "description": "Valida se o sistema atende às expectativas do usuário final.",
    "full_text": "O Teste de Aceitação (UAT - User Acceptance Testing) é o teste final antes da implantação do software, realizado pelos usuários finais ou clientes. O objetivo é verificar se o sistema atende aos requisitos de negócio e às expectativas do usuário em um ambiente que simula o ambiente de produção. É crucial para garantir que o software seja útil e utilizável para quem o encomendou.",
    "example": "Exemplo: Um grupo de usuários beta de um novo aplicativo bancário realiza transações reais (em um ambiente de teste) para confirmar que todas as funcionalidades bancárias operam conforme suas necessidades e expectativas.",
    "video_link": ""
  },
  {
    "id": "sistema",
    "title": "Teste de Sistema",
    "description": "Analisa o sistema como um todo, incluindo interfaces e dados.",
    "full_text": "O Teste de Sistema avalia o sistema completo e integrado para verificar se ele atende aos requisitos funcionais e não funcionais especificados. Ele testa o comportamento do sistema de ponta a ponta, incluindo a interação entre todos os seus componentes, hardware, software e dados. O objetivo é validar o sistema como uma entidade única.",
    "example": "Exemplo: Testar um sistema de gestão de estoque completo, desde a entrada de novos produtos, atualização de inventário, processamento de pedidos, até a geração de relatórios de vendas, garantindo que todos os fluxos de trabalho funcionem sem problemas.",
    "video_link": ""
  },
  {
    "id": "performance",
    "title": "Teste de Performance",
    "description": "Avalia o tempo de resposta, escalabilidade e estabilidade.",
    "full_text": "O Teste de Performance é um tipo de teste não funcional que avalia a velocidade, capacidade de resposta e estabilidade de um sistema sob uma carga de trabalho específica. Ele ajuda a identificar gargalos, medir a capacidade do sistema e garantir que ele possa lidar com o volume esperado de usuários e transações sem degradação do desempenho.",
    "example": "Exemplo: Simular 1000 usuários simultâneos acessando um site de vendas durante a Black Friday para verificar se o tempo de resposta das páginas permanece abaixo de 2 segundos e se o sistema não apresenta erros ou lentidão excessiva.",
    "video_link": ""
  }
]


